{
    "乾乾":{
        "name":"乾为天",
        "words":"元亨利贞。",
        "white_words":"《乾》卦:大通顺，占问有利。",
        "stock_suggestion":"阳阳阳阳阳阳，主力实力强劲，走势直线拉升。基本面上相当不错题材和走势纯正，较为引人关注持股待涨，见顶则卖出。",
        "yaoci":"九二二爻上上：得意宜逢贵，前程去有缘。利名终有望，三五月团圆。\n　　  九四四爻中中：欲行不止，徘徊不已。藏玉怀珠，片帆千里。\n　　  上九六爻下下：心戚戚，口啾啾。一番思量一番忧，说了休时又不休。\n",
        "picture":"天行健，君子以自强不息。",
        "white_picture":"天道刚健，运行不已。君子观此卦象，从而以天为法，自强不息。"
    },

    
    "兑乾":{
        "name":"泽天夬",
        "words":"扬于王庭，孚号，有厉。告自邑，不利即戎，利有攸往。",
        "white_words":"《夬》卦：(有人以军功被)举用于王庭，(他献的)俘虏号哭。有危 险的事，从邑里来报告。出兵不利，有所往有利。",
        "stock_suggestion":"阴阳阳阳阳阳：泽，水积聚的地方。有洪水涨上天之象。洪水滔天，必冲决堤防。牛熊分水岭，先升后跌，转势，注意逃顶。可卖不可买 ",
        "yaoci":"初九初爻下中：神黯黯，意悠悠。收却线，莫下钩。\n　　  九三三爻中平：虎伏在前途，行人莫乱呼。路旁须仔细，灾祸自然无。\n　　  九五五爻下下：所事纵云难，平地起波澜。笑谈终有忌，事回心觉安。\n",
        "picture":"泽上于天，夬。君子以施禄及下，居德则忌。",
        "white_picture":"上卦为兑，兑为泽；下卦为乾，乾为天，可见泽水上涨，浇灌大地，是夬卦的卦象。君子观此卦象，从而泽惠下施，不敢居功自傲，并以此为忌。"
    },
    "离乾":{
        "name":"火天大有",
        "words":"元亨。",
        "white_words":"《大有》卦:大通顺。",
        "stock_suggestion":"阳阴阳阳阳阳，火在天上，明烛四方，题材领头羊.日丽中天之象。防好景不常 ",
        "yaoci":"九二二爻上中：一重水，一重山，风波道坦然，壶中别有天。\n　　  九四四爻上上：遇险不为忧，风波何足惧。若遇草头人，咫尺青云路。\n　　  上九六爻上上：奇奇奇，地利与天时。灯花传信后，动静总相宜。\n",
        "picture":"火在天上，大有。君子以遏恶扬善，顺天休命。",
        "white_picture":"火在天上，明烛四方，君子观此卦象，取法于火，洞察善恶，抑恶扬善，从而顺应天命，祈获好运。"
    },
    "震乾":{
        "name":"雷天大壮",
        "words":"利贞。",
        "white_words":"《大壮》卦：占问有利。",
        "stock_suggestion":"阴阴阳阳阳阳，天上鸣雷，声威显赫。云雷涌动，群阳盛壮，牛气冲天，先顺后毖，节制勿贪。",
        "yaoci":"初九初爻下下：江阔渡无船，惊涛恐拍天。月斜云淡处，音信有人传。\n　　  三九三爻下中：平地起风烟，时下未能安，高处觅因缘。\n　　  六五五爻下中：正直宜守，妄动生灾。名通利达，叶落花开。\n",
        "picture":"雷在天上，大壮。君子以非礼弗履。",
        "white_picture":"天上鸣雷是大壮的卦象。君子观此卦象，以迅雷可畏，礼法森严，从而畏威知惧，唯礼是遵。"
    },
    "巽乾":{
        "name":"风天小畜",
        "words":"亨。密云不雨，自我西郊。",
        "white_words":"《小畜》卦:通顺。云浓不下雨，从我的西郊来。",
        "stock_suggestion":"阳阳阴阳阳阳，上卦为巽，巽为风。有和风满天，风调雨顺之象，卦辞以云气积聚，比喻所占之事正在酝酿，蓄养实力之意,未到拉升之时",
        "yaoci":"九二二爻上中：金鳞入手，得还防走。若论周旋，谨慎戒口。\n　　  陆肆四爻中中：上下不和同，劳而未有功。出门通大道，从此何初终。\n　　  上九六爻上中：拟欲迁而未可迁，提防喜处惹勾连。前途若得阴人引，变化鱼龙出大渊。\n",
        "picture":"风行天上，小畜。君子以懿文德。",
        "white_picture":"上卦为巽，巽为风；下卦为乾，乾为天，和风拂地，草木低昂，勃勃滋生，这是小畜的卦象。君子观此卦象，取法催发万物的和风，自励风范，推行德教。"
    },
    "坎乾":{
        "name":"水天需",
        "words":"有孚，光亨，贞吉。利涉大川。",
        "white_words":"《需》卦:有收获，大通顺，占问吉。渡大河有利",
        "stock_suggestion":"阴阳阴阳阳阳，水汽聚集天上成为云层，密云満天，但还没有下雨，量价不济，耐心等待 ",
        "yaoci":"初九初爻上中：过尽山前后，艰阻往来难。若得清风便，扁舟过远山。\n　　  九三三爻上中：君子升，小人阻。征战生离苦。前途自有吉人逢，信在马羊人在楚。事可忧?要营求。\n　　  九五五爻中中：久历惊涛，东风便好。太平身退，目下尚早。\n",
        "picture":"云上于天，需；君子以饮食宴乐。",
        "white_picture":"云浮聚于天上，待时降雨是需卦的卦象。君子观此卦象，可以宴饮安乐，待时而动。"
    },
    "艮乾":{
        "name":"山天大畜",
        "words":"利贞，不家食，吉。利涉大川。",
        "white_words":"《大畜》卦：占问有利。不靠家里吃饭，吉。渡大河有利。",
        "stock_suggestion":"阳阴阴阳阳阳，太阳照耀于山中，万物摄取阳光雨露，象征大量的畜养积聚。看似波澜不惊,实则蕴含冲升，积蓄力量，将冲破阻力。",
        "yaoci":"九二二爻中中：蜗角蝇头利，而今已变通。草头人笑后，宜始不宜终。\n　　  陆肆四爻下中：鹊噪高枝上，人行古渡头。半途不了事，日暮转生愁。\n　　  上九六爻上上：事有喜，物有光。始终好商量，壶中日月长。\n",
        "picture":"天在山中，大畜。君子以多识前言往行，以畜其德。",
        "white_picture":"太阳照耀于山中，万物摄取阳光雨露，各遂其生，这是大畜的卦象。君子观此卦象，从而广泛地了解古人的嘉言善行，来培养自己的德行。"
    },
    "坤乾":{
        "name":"地天泰",
        "words":"小往大来，吉，亨。",
        "white_words":"《泰》卦:小的去了大的来，吉，通顺。",
        "stock_suggestion":"阴阴阴阳阳阳，阴气凝重而下沉，阳气清明而上升，阴阳转化,小跌大涨,边洗边拉。",
        "yaoci":"初九初爻上中：东边事，西边成。风物月华明，高楼弄笛声。\n　　  九三三爻下下：和不和，同不同，翻云覆雨几成空，进退须防终少功。\n　　  六五五爻上上：添一人，获一宝。事团圆，门外讨。\n",
        "picture":"天地交，泰；后以财成天地之道，辅相天地之宜，以左右民。",
        "white_picture":"地气上升，乾气下降，为地气居于乾气之上之表象，阴阳二气一升一降，互相交合，顺畅通达。"
    },

    "乾兑":{
        "name":"天泽履",
        "words":"履虎尾，不咥人，亨。",
        "white_words":"《履》卦:踩着老虎尾巴，老虎不咬人。通顺",
        "stock_suggestion":"阳阳阳 阴阳阳，上天下泽，尊卑显别，喻指弱者以和悦的态度应和强暴之人，如履虎尾之象　险中求胜之意，高位小心跟庄家虽不敢搅局,缺虎视眈眈。",
        "yaoci":"初九初爻上中：不远不近，似易似难。等闲入手，云中笑看。\n　　  六三三爻下下：桃李谢春风，西去又复东。家中无意绪，船在浪涛中。\n　　  九五五爻中中：狂风吹起黑云飞，月在天心遮不得。时闲无事暂相关，到底依然无刻剥。\n",
        "picture":"上天下泽，履。君子以辨上下，定民志。",
        "white_picture":"上天下泽，尊卑显别，这是履卦的卦象。君子观此卦象，从而分别上下尊卑，使人民循规蹈矩，安份守纪。"
    },
    "兑兑":{
        "name":"兑为泽",
        "words":"亨，利，贞。",
        "white_words":"《兑》卦：通顺，利于占问。",
        "stock_suggestion":"阴阳阳阴阳阳，有两泽相连，两水交流之象，喻上下相和，则团结一致震荡，觉着做事不费力。消息偏多,高抛低吸.休要错过这机会，但小心偏线。",
        "yaoci":"九二二爻上上：玉出昆冈石，舟离古渡滩。行藏终有望，用舍不为难。\n　　  九四四爻下下：难难难，忽然平地起波澜。易易易，谈笑平常终有忌。\n　　  上六六爻下下：乐之极矣悲相望，引兑来兮吉与凶。未能光大终须暗，日落西山返照中。\n",
        "picture":"丽泽，兑。君子以朋友讲习。",
        "white_picture":"两泽相连，两水交流是兑卦的卦象。君子观此卦象，从而广交朋友，讲习探索，推广见闻。"
    },
    "离兑":{
        "name":"火泽睽",
        "words":"小事吉。",
        "white_words":"《睽》卦：做小事吉。",
        "stock_suggestion":"阳阴阳 阴阳阳，离火向上，兑泽则向下，一上一下，两相乖违，又二女同居，不得正之象。多空分歧,可得小利。",
        "yaoci":"初九初爻下中：上下分，忧愁决。千嶂云，一轮月。\n　　  六三三爻下下：鼎沸风波，孤舟渡河。巧中藏拙，人事蹉跎。\n　　  六五五爻下中：船棹中流急，花开春又迟。事宁心不静，惹起许多疑。\n",
        "picture":"上火下泽，睽。君子以同而异。",
        "white_picture":"上火下泽，两相乖离，是睽卦的卦象。君子观此卦象，从而综合万物之所同，分析万物之所异。"
    },
    "震兑":{
        "name":"雷泽归妹",
        "words":"征凶，无攸利。",
        "white_words":"《归妹》卦：出外作战不吉利，没有利益收获。",
        "stock_suggestion":"阳阴阴 阴阳阳，泽上雷鸣，雷鸣水动，用以喻男女心动相爱成配。震长男在上，兑少女在下，女必归从，归即是出嫁，但少女配长男，非正常组合，处事有违常理正道，先得其益，但随后祸事百端。",
        "yaoci":"九二二爻下中：门外事重叠，阴人多遇合。贤女虽助巧，渺渺终难洽。\n　　  九四四爻下中：缺月重圆，枯枝又鲜。一条坦路，翘首青天。\n　　  上六六爻中中：美红颜，休挂怀。人在车中，舟行海底。\n",
        "picture":"泽上有雷，归妹。君子以永终知敝。",
        "white_picture":"泽上雷鸣，雷鸣水动，用以喻男女心动相爱而成眷属。这是归妹卦的卦象。君子观此卦象，从而在长期的婚姻生活中，体察到婚姻的成功与失败。"
    },
    "巽兑":{
        "name":"风泽中孚",
        "words":"豚鱼，吉。利涉大川，利贞。",
        "white_words":"《中孚》卦：心中有诚信，用猪和鱼祭祀也吉利，利于渡大河，有利占问。",
        "stock_suggestion":"阳阳阴 阴阳阳，中孚为诚信意，风吹在泽水之上，泽水必相应而起波浪，为共鸣之象。股价大幅波动.誠信運氣好。",
        "yaoci":"初九初爻上中：一点著阳春，枯枝朵朵荣。志专方遇合，初忌二三心。\n　　  六三三爻中中：欲行迁止，徘徊不已。动摇莫强，得止且止。\n　　  九五五爻上上：倾一杯，转愁眉。天地合，好施为。\n",
        "picture":"泽上有风，中孚。君子以议狱缓死。",
        "white_picture":"泽上有风，风起波涌。这是中孚的卦象。君子观此卦象，有感于风化邦国，唯德教为先，因而审议讼狱，不轻置重典。"
    },
    "坎兑":{
        "name":"水泽节",
        "words":"亨，苦节不可贞。",
        "white_words":"《节》卦：通顺，将节俭视为苦事是不可以去占问的。",
        "stock_suggestion":"阴阳阴 阴阳阳，泽为池沼，坎水在上，喻蓄积及约束水份不使流失，但水位过高，则成泛滥，务必高筑堤防以约束之。横盘震荡，升跌有制,可获利,不可贪欲。",
        "yaoci":"九二二爻下下：休眷恋，奔前程。终闹乱，出门庭。\n　　  陆肆四爻上上：用则行，舍则藏。一骑出重关，佳音咫尺间。\n　　  上六六爻下下：渴穿井，饥画饼。漫劳心，如捕影。遇龙虎，方可省。\n",
        "picture":"泽上有水，节。君子以制数度，议德行。",
        "white_picture":"泽中水满，因而须高筑堤防，这是节卦的卦象。君子观此卦象，从而建立政纲制度，确立伦理原则。"
    },
    "艮兑":{
        "name":"山泽损",
        "words":"有孚，元吉，无咎，可贞。利有攸往。曷之用？二簋可用享。",
        "white_words":"《损》卦：得俘虏，大吉，无害。占问可行。有所往，有利。送饭 用二个圆器，也可用来祭祀。",
        "stock_suggestion":"阳阴阴 阴阳阳，山高水深，有大泽浸蚀山根之象。大跌，连续跳水，及时止损。不抱幻想,上扬则继续持有。",
        "yaoci":"初九初爻下中：喜喜喜，终防否。获得骊龙颔下珠，忽然失却还沉水。\n　　  六三三爻中中：事未完，心未安。疑虑久，得安然。\n　　  六五五爻中中：莫言枳棘恶，终为鸾凤栖。目前应有待，何用早踌躇。\n",
        "picture":"山下有泽，损。君子以征忿窒欲。",
        "white_picture":"山下有泽是损卦的卦象。君子观此卦象，以泽水浸蚀山脚为戒，从而制止其忿怒，杜塞其贪欲。"
    },
    "坤兑":{
        "name":"地泽临",
        "words":"元，亨，利，贞。至于八月有凶。",
        "white_words":"《临》卦:大通顺，占问有利。到了八月有凶(因天旱不雨)。",
        "stock_suggestion":"阴阴阴 阴阳阳，池泽之水灌溉地面万物，阳气渐生渐长，渐渐居临于上。突破，转势变盘在即，宜做进出准备。弹性偏高。",
        "yaoci":"九二二爻上上：和合事，笑谈成。喜音在半程，平步踏青云。\n　　  陆肆四爻上上：事团圆，物周旋。一往一来，平步青天。\n　　  上六六爻上中：朦胧秋月映朱扃，林处鸡声远处生。自有贵人相接引，何须巧语似流莺。\n",
        "picture":"泽上有地，临。君子以教思无穷，客保民无疆。",
        "white_picture":"堤岸高出大泽，河泽容于大地，这是临卦的卦象。君子观此卦象，君临天下，教化万民，覃恩极虑，保容万民，德业无疆。"
    },

    "乾离":{
        "name":"天火同人",
        "words":"同人于野，亨。利涉大川，利君子贞。",
        "white_words":"《同人》卦:聚众在野外，通顺，利于渡大河，利于正直的人占问。",
        "stock_suggestion":"阳阳阳 阳阴阳，乾为天，为君；下卦为离，离为火，为臣民。二人(主力/散户)同心之象,众星捧月,合作共事之意。火光冲天，人心趋同，迎合大势。",
        "yaoci":"六二二爻上上：心和同，事和同，门外好施工，交加事有终。\n　　  九四四爻中平：意孜孜，心戚戚，要平安，防出入。\n　　  上九六爻上中：一水绕一水，一山绕一山。水尽山穷处，名利不为难。\n",
        "picture":"天与火，同人；君子以类族辨物。",
        "white_picture":"同人之卦，上卦为乾为天为君王，下卦为离为火为臣民，上乾下离象征君王上情下达，臣民下情上达，君臣意志和同，这是同人的卦象。君子观此卦象，取法于火，明烛天地，照亮幽隐，从而去分析物类，辨明情状。"
    },
    "兑离":{
        "name":"泽火革",
        "words":"己日乃孚。元亨利贞。悔亡。",
        "white_words":"《革》:祭祀之日怀着诚信的态度， 一开始就顺利，利于占问，悔恨消失。",
        "stock_suggestion":"阴阳阳 阳阴阳，水火相聚则互相克制，兑为金，被离火所烧，变革之象。无法判断利弊,基本面大变,变化,变革,可参考变爻。",
        "yaoci":"初九初爻下中：意迷心不迷，事宽心不宽。要知端的事，犹隔两重山。\n　　  九三三爻中中：道路迢遥，门庭闭塞。雪拥未分明，云开方见日。\n　　  九五五爻上中：虎变高山别有期，望人目下尚狐疑。雁来嘹呖黄花发，此际声名达帝畿。\n",
        "picture":"泽中有火，革。君子以治历明时。",
        "white_picture":"内蒸外煏，水涸草枯，如同水泽之中，大火燃烧，这是革卦的卦象。君子观此卦象，了解到泽水涨落，草木枯荣的周期变化，从而修治历法，明确时令。"
    },
    "离离":{
        "name":"离为火",
        "words":"利贞，亨。畜牝牛，吉。",
        "white_words":"《离》卦：占问有利。通顺。养母牛吉。",
        "stock_suggestion":"阳阴阳 阳阴阳，丽日当天之象　光明远大之意，主升时期,气势如虹。",
        "yaoci":"六二二爻上上：谋已定，事何忧。明月上重楼，云中客点头。\n　　  九四四爻下下：遇不遇，逢不逢。月沉水底，人在梦中。\n　　  上九六爻中中：诛战中邦利出征，一朝获丑在王庭。凤衔一诏堤场畔，得个佳名四海荣。\n",
        "picture":"明两作，离。大人以继明照四方。",
        "white_picture":"今朝太阳升，明朝太阳升，相继不停顿，这是离卦的卦象。贵族王公观此卦象，从而以源源不断的光明照临四方。"
    },
    "震离":{
        "name":"雷火丰",
        "words":"亨。王假之，勿忧，宜日中。",
        "white_words":"祭祀，王到庙。不用担忧，应该在太阳正中时祭祀。",
        "stock_suggestion":"阴阴阳 阳阴阳上卦为震，震为雷；下卦为离，离为电。电闪雷鸣，是上天垂示的重大天象。大升，强势,人气沸腾。",
        "yaoci":"初九初爻上中：过尽风波三五重，谁知浪尽又无风。须知明达青云路，用舍行藏不费功。\n　　  九三三爻下下：纷纷复纷纷，欷嘘独掩门。敛眉望灯火，伴我坐黄昏。\n　　  六五五爻下中：门内佳音来，生涯应有庆。名利有更迁，雁行终拆阵。\n",
        "picture":"雷电皆至，丰。君子以折狱致刑。",
        "white_picture":"电闪雷鸣，是上天垂示的重大天象，这也是丰卦的卦象。君子观此卦象，有感于电光雷鸣的精明和威严，从而裁断讼狱，施行刑罚。"
    },
    "巽离":{
        "name":"风火家人",
        "words":"利女贞。",
        "white_words":"《家人》卦，妇女占问有利。",
        "stock_suggestion":"阳阳阴阳阴阳，内火外风，风助火势，火助风威，相辅相成，涨升有序，无益无害。风云际会,走高。",
        "yaoci":"六二二爻下中：一镜破，照两人。心中结，合同心。\n　  　陆肆四爻上上：珠玉走盘中，田园足阜丰。休言谋未遂，此去一时通。\n　　  上九六爻上中：心下事悠然，周旋尚未全。遇龙终有吉，人月永团圆。\n",
        "picture":"风自火出，家人。君子以言有物，而行有恒。",
        "white_picture":"内火外风，风助火势，火助风威，相辅相成，是家人的卦象。君子观此卦象，从而省悟到言辞须有内容才不致于空洞，德行须持之以恒才能充沛。"
    },
    "坎离":{
        "name":"水火既济",
        "words":"亨，小利贞，初吉终乱。",
        "white_words":"《既济》卦：通顺，占问会有些吉利，开始时吉利，最后动荡不安。",
        "stock_suggestion":"阴阳阴 阳阴阳，水处火上，水火相济。完成之意。可离场。",
        "yaoci":"初九初爻上上：鹿逐云中出，人从月下归。新欣盈笑脸，不用皱双眉。\n　　  九三三爻上中：入而易，出而难。厌厌到再三，交加意不堪。\n　  　九五五爻中中：积德施功有子孙，杀牛祭佛及西邻。功名两字垂成日，回首山前万物新。\n",
        "picture":"水在火上，既济。君子以思患而预防之。",
        "white_picture":"水上火下，水浇火熄，是既济之卦的卦象。君子观此卦象，从而有备于无患之时，防范于未然之际。"
    },
    "艮离":{
        "name":"山火贲",
        "words":"亨。小利有攸往。",
        "white_words":"《贲》卦：通顺。有所往得小利。",
        "stock_suggestion":"阳阴阴 阳阴阳，山下有火，一片艳红，花木相映，锦绣如文。快进快出。空头有阻拦,不可追高。",
        "yaoci":"六二二爻上上：月已圆，花再发。事悠悠，无不合。\n　  　陆肆四爻上中：曲中应有直，心事还成戚。云散月重圆，千里风帆急。\n　  　上九六爻上上：明月重圆，颜色欣然。风云相送，和合万年。\n",
        "picture":"山下有火，贲。君子以明庶政，无敢折狱。",
        "white_picture":"山下有火，火燎群山，这是贲卦的卦象。君子观此卦象，思及猛火燎山，玉石俱焚，草木皆尽，以此为戒，从而明察各项政事，不敢以威猛断狱。"
    },
    "坤离":{
        "name":"地火明夷",
        "words":"利艰贞。",
        "white_words":"《明夷》卦：占问艰难的事有利。",
        "stock_suggestion":"阴阴阴 阳阴阳，上坤下离，是日没入地中之象。太阳既没，天地黑暗，前途莫测，喻君子处艰难之中跌。难。",
        "yaoci":"初九初爻中中：乘翼遥飞去，皆因避远行。一途经济意，又是满园春。\n　  　九三三爻上中：虚名虚位久沉沉，禄马当头未见真。一片彩云秋后至，去年风物一时新。\n　  　六五五爻下下：重关深锁闭，谨慎要提防。小节不知戒，因循成大殃。\n",
        "picture":"明入地中，明夷。君子以莅众，用晦而明。",
        "white_picture":"太阳没入地中，是明夷的卦象。君子观此卦象，治民理政，不以苛察为明，而是外愚内慧，容物亲众。"
    },

    "乾震":{
        "name":"天雷无妄",
        "words":"元，亨，利，贞。其匪正有眚，不利有攸往。",
        "white_words":"《无妄》:大通顺，占问有利。倘他的行动不正确，有灾祸，有所 往不利。",
        "stock_suggestion":"阳阳阳 阴阴阳，在天的下面有雷在运行之表象，象征着天用雷的威势警戒万物，并赋予万物以不妄动妄求的本性。股价走势纯正,不作非分之想。",
        "yaoci":"初九初爻上上：事扛扶，在半途，翻覆终可免，风波一点无。\n　  　六三三爻下下：浅水起波澜，平地生荆棘。言语虚参商，犹恐无端的。\n　  　九五五爻上上：喜喜喜，春风生桃李。不用强忧煎，明月人千里。\n",
        "picture":"天下雷行，物与无妄。先王以茂对时，育万物。",
        "white_picture":"天宇之下，春雷滚动，万物萌发，孳生繁衍，这是无妄的卦象。先王观此卦象，从而奋勉努力，顺应时令，保育万物。"
    },
    "兑震":{
        "name":"泽雷随",
        "words":"元亨，利贞，无咎。",
        "white_words":"《随》卦:大通顺，占问有利，无害。",
        "stock_suggestion":"阴阳阳 阴阴阳，雷入泽中，大地寒凝，万物蛰伏。震木在兑泽之下，木必随水漂荡，随者，顺也,随波逐流,无主动性。",
        "yaoci":"六二二爻中平：一事已成空，一事还成喜。若遇口边人，心下堪凭倚。\n  　　九四四爻下中：鱼上钩，丝纶弱。收拾难，力再著。\n　  　上六六爻上上：可蓄可收，片玉寸珠。停停稳稳，前遇良图。\n",
        "picture":"泽中有雷，随。君子以向晦入宴息。",
        "white_picture":"雷入泽中，大地寒凝，万物蛰伏，是随卦的卦象。君子观此卦象，取法于随天时而沉寂的雷声，随时作息，向晚则入室休息。"
    },
    "离震":{
        "name":"火雷噬嗑",
        "words":"亨。利用狱。",
        "white_words":"《噬嗑》卦：通顺。有利于诉讼。",
        "stock_suggestion":"阳阴阳 阴阴阳，炒作!雷电交击，买卖汇集；雷有威慑力，电能放光明。跌，凶险，违归，陷阱，被套。",
        "yaoci":"初九初爻上中：人倚楼，许多愁。淡然进步，事始无忧。\n　　  六三三爻上中：暗中防霹雳，猜疑浑未实。转眼黑云收，拥出扶桑日。\n　  　六五五爻下下：堪叹枕边忧，更嗟门里闹。意绪甚索缠，心神亦颠倒。\n",
        "picture":"雷电噬嗑。先王以明罚敕法。",
        "white_picture":"雷电交合是噬嗑的卦象。先王观此卦象，取法于威风凛凛的雷、照彻幽隐的电，思以严明治政，从而明察其刑罚，修正其法律。"
    },
    "震震":{
        "name":"震为雷",
        "words":"亨。震来虩虩，笑言哑哑。震惊百里，不丧匕鬯。",
        "white_words":"《震》卦：通顺。霹雳使人恐惧，后来若无其事地谈笑。雷声使百 里内的人都吓惊，这个人却镇定得连手持酒杯中的酒都没有洒出一滴来。",
        "stock_suggestion":"阴阴阳 阴阴阳，两震相叠，有巨雷连击，震惊百里之象，所以卦名曰震。用以喻天威莫测，灾祸难料，警戒人们敬天修德，省身远恶。借力打力.震荡，大副震荡，惊吓，迅雷不及掩耳。",
        "yaoci":"六二二爻下下：无踪又无迹，远近终难觅。旱海莫行舟，何劳空著力。\n　  　九四四爻上中：白玉隐尘，黄金埋土。久久光辉，也要人举。\n　  　上六六爻下中：细雨濛濛湿，江边路不通。道途人未达，凭仗借东风。\n",
        "picture":"洊雷，震。君子以恐惧修省。",
        "white_picture":"巨雷连击，是震卦的卦象。君子观此卦象，从而戒惧恐惧，修省其身。"
    },
    "巽震":{
        "name":"风雷益",
        "words":"利有攸往，利涉大川。",
        "white_words":"《益》卦：有所往有利，渡大河有利。",
        "stock_suggestion":"阳阳阴 阴阴阳，风雷激荡，其势愈增,上行下挫之象，上行则出货得利，下行则吸纳待机。",
        "yaoci":"初九初爻上中：大事可成功，有益还无咎。云内执鞭人，报在三秋后。\n  　　六三三爻下下：无踪又无迹，远近终难觅。旱海莫行舟，何劳空费力。\n　  　九五五爻上上：子结花残，花开枯树。屋头春意喜，笑嘻嘻。\n",
        "picture":"风雷，益。君子以见善则迁，有过则改。",
        "white_picture":"风雷激荡，是益卦的卦象。君子观此卦象，惊恐于风雷的威力，从而见善则从之，有过则改之。"
    },
    "坎震":{
        "name":"水雷屯",
        "words":"元，亨，利，贞。勿用，有攸往，利建侯。",
        "white_words":"《屯》卦： 一开始就顺利，利于占问，不要出外办事，但有利分封诸侯。",
        "stock_suggestion":"阳阴阳 阴阴阳，震，表示雷。坎，表示雨。雷雨并作，环境险恶，低迷不振。",
        "yaoci":"六二二爻上中：事迟志速，而且反复。直待岁寒，花残果熟。\n  　　陆肆四爻上上：乘马班如，求婚媾吉。随时谐义，缺月重明。\n  　　上六六爻下下：不足不足，难伸心曲。野塘雨过，月如钩，梦断邯郸眉黛蹙。\n",
        "picture":"云，雷，屯；君子以经纶。",
        "white_picture":"云行于上，雷动于下，是屯卦的卦象。君子观此卦象，取法于云雷，用云的恩泽，雷的威严来治理国事。"
    },
    "艮震":{
        "name":"山雷颐",
        "words":"贞吉。观颐，自求口实。",
        "white_words":"《颐》卦：占问吉。观察面颊(看人是否吃饱),自己要求得口粮(来 吃饱)。",
        "stock_suggestion":"阳阴阴 阴阴阳，雷出山中，正是春暖之际，天地养育万物之时，蓄势待发,发动又遭打压,食品酒类题材。",
        "yaoci":"初九初爻下下：红叶无颜色，凋零一夜风。邻鸡醒午梦，心事总成空。\n　  　六三三爻下下：事宜休，理多错。日掩云中，空成担阁。\n　  　六五五爻下中：进不安，退不可。上下相从，明珠一颗。\n",
        "picture":"山下有雷，颐。君子以慎言语，节饮食。",
        "white_picture":"雷出山中，万物萌发，这是颐卦的卦象。君子观此卦象，思生养之不易，从而谨慎言语，避免灾祸。节制饮食，修身养性。"
    },
    "坤震":{
        "name":"地雷复",
        "words":"亨。出入无疾，朋来无咎。反复其道，七日来复，利有攸往。",
        "white_words":"《复》卦：通顺。出门的人不生病。赚了钱没有害。在路上来回， 七天就能来回。有所往有利。",
        "stock_suggestion":"阴阴阴 阴阴阳, 股价长时间低迷,有发动之相.主力吸筹充分,开始试盘拉升。",
        "yaoci":"六二二爻上中：悲后笑嘻嘻，中行道最宜。所求终有望，不必皱双眉。\n　  　陆肆四爻上中：临渊放钓，清绝点埃。巨鳌随得，何用疑猜。\n　  　上六六爻下下：进步且徘徊，春风柳絮催。水边行客倦，枕畔有忧怀。\n",
        "picture":"雷在地中，复。先王以至日闭关，商旅不行，后不省方。",
        "white_picture":"天寒地冻，雷返归地中，往而有复，依时回归，这是复卦的卦象。先王观此卦象，取法于雷，在冬至之日关闭城门，不接纳商旅，君王也不巡视邦国"
    },

    "乾巽":{
        "name":"天风姤",
        "words":"女壮，勿用取女。",
        "white_words":"《姤》卦：女子强壮(胜于男),不要娶这个女子。",
        "stock_suggestion":"阳阳阳 阳阳阴，天下有风，吹拂万物；风云际会之象　聚散随缘之意。盛阳遇阴，遭遇空头，久升必跌。利空成势。",
        "yaoci":"九二二爻下中：欲济未济，欲求强求。心无一定，一车两头。\n　　  九四四爻下下：居下当亲上，人心易散离。事械才一失，万事尽皆灭。\n  　　上九六爻下下：见不见，也防人背面。遇不遇，到底无凭据。\n",
        "picture":"天下有风，姤。后以施命诰四方。",
        "white_picture":"天下有风，是姤卦的卦象，君王观此卦象，从而效法于风之吹拂万物，施教化于天下，昭告四方。"
    },
    "兑巽":{
        "name":"泽风大过",
        "words":"栋桡。利有攸往，亨。",
        "white_words":"《大过》卦：正梁弯曲，利于出外有所往，通顺。",
        "stock_suggestion":"阴阳阳 阳阳阴，上兑下巽，有泽水淹没木舟之象。升跌过头，风险极大,拉升乏力,折价。",
        "yaoci":"初六初爻中中：心有余，力不足。倚仗春风，一歌一曲。\n　　  九三三爻下下：荆棘生平地，风波起四方。倚阑惆怅望，无语对斜阳。\n　  　九五五爻中中：一人两事，一人两心。新花枯树，须待交春。\n",
        "picture":"泽灭木，大过。君子以独立不惧，遁世无闷。",
        "white_picture":"泽水淹没木舟，这是大过的卦象。君子观此卦象，以舟重则覆为戒，领悟到遭逢祸变，应守节不屈，稳居不仕，清静淡泊。"
    },
    "离巽":{
        "name":"火风鼎",
        "words":"元吉，亨。",
        "white_words":"《鼎》卦：大吉利，通顺。",
        "stock_suggestion":"阳阴阳 阳阳阴，木之上有离火，为燃炊烹饪之象，鼎器烹调之象，去故取新,自然之意。",
        "yaoci":"九二二爻上上：小子出门庭，青衣久问程。贵人来助力，花谢子还成。\n　  　九四四爻下中：鼎折足，舆脱辙。有贵人，重相续。\n　  　上九六爻上上：贵客自相亲，功名唾手成。获金须积德，仰望太阳升。\n",
        "picture":"木上有火，鼎。君子以正位凝命。",
        "white_picture":"木上有火，以鼎烹物，这是《鼎》卦的卦象。君子观此卦象，取法于鼎足三分，正立不倚，从而持正守位，为君上所倚重，不负使命。"
    },
    "震巽":{
        "name":"雷风恒",
        "words":"亨，无咎，利贞。利有攸往。",
        "white_words":"《恒》卦：通顺，无害。占问有利。有所往有利。",
        "stock_suggestion":"阴阴阳阳阳阴，风雷荡涤，宇宙常新，横盘,股价波动较小，难以投机。主力积货其中，进出不易。",
        "yaoci":"初六初爻下下：深潭月，明镜影。一场空，妄报信。\n　  　九三三爻下下：桥已断，路不通。登舟理楫，又遇狂风。\n　  　六五五爻下下：湖水悠悠，孤舟浪头。来人未识，残月山楼。\n",
        "picture":"雷风，恒。君子以立不易方。",
        "white_picture":"风雷荡涤，宇宙常新，这是恒卦的卦象。君子观此卦象，从而立于正道，坚守不易。"
    },
    "巽巽":{
        "name":"巽为风",
        "words":"小亨。利有攸往，利见大人。",
        "white_words":"《巽》卦：小通顺，有利于前往，有利于谒见重要的人物。",
        "stock_suggestion":"阳阳阴 阳阳阴，长风相随，吹拂不断。顺势而为,随机应变。",
        "yaoci":"九二二爻下下：下著占先机，其中路不迷。目前无含意，争免是和非。\n　  　陆肆四爻上上：江海悠悠，烟波下钩。六鳌连获，歌笑中流。\n　  　上九六爻下下：一月圆，一镜缺。少团圆，无可说。\n",
        "picture":"随风，巽。君子以申命行事。",
        "white_picture":"长风相随，吹拂不断，是巽卦的卦象。君子观此卦象，取法于长吹不断的风，从而不断地申明教义，反复地颁行政令，灌输纲常大义。"
    },
    "坎巽":{
        "name":"水风井",
        "words":"改邑不改井，无丧无得。往来井井。汔至，亦未繘井，羸其瓶，凶。",
        "white_words":"《井》:住户可以搬迁，但泉井不能移动。纵使人来人往取水，井既无损失亦无得益。如果你有机会，却不用绳绑吊桶来取水，吊桶就会腐坏，凶。",
        "stock_suggestion":"阳阴阳 阳阳阴，下卦为巽，巽为木。上坎下巽，有树木得水滋润而蓬勃生长之象。跌，珠落深渊，守静安常。主力高度控盘.升降有序。",
        "yaoci":"初六初爻中中：月在云间，昏迷道路。云散月明，渐宜进步。\n　  　九三三爻下下：安静事难疑，云中一鹤飞。桃花逢骤雨，水畔女频啼。\n　  　九五五爻上中：美在甘，甘有香。始有终，终有始。\n",
        "picture":"木上有水，井。君子以劳民劝相。",
        "white_picture":"水下浸而树木生长，这是井卦的卦象。君子观此卦象，取法于井水养人，从而鼓励人民勤劳而互相劝勉。"
    },
    "艮巽":{
        "name":"山风蛊",
        "words":"元亨，利涉大川。先甲三日，后甲三日。",
        "white_words":"《蛊》卦:大通顺。渡大河有利，在辛日，在丁日。",
        "stock_suggestion":"阳阴阴阳阳阴，风入山下，闭而不出，即物腐生虫，意气不通，因循败事。阴跌，大盘入低谷，个股入黄昏，吐故纳新。",
        "yaoci":"九二二爻上中，暗去又明来，忧心事可谐。终须成一笑，日下莫疑猜。\n　  　陆肆四爻中中：可以委，可以托。事迟迟，无差错。\n　  　上九六爻上中：深渊鱼可钓，幽林鸟可疾。只用久长心，不用生疑惑。\n",
        "picture":"山下有风，蛊。君子以振民育德。",
        "white_picture":"贤人如山居于上，宣布德教施于下，所谓山下有风，这是巽卦盼卦象。君子观此卦象，取法于吹拂万物的风，从而振救万民，施行德教。"
    },
    "坤巽":{
        "name":"地风升",
        "words":"元亨。用见大人，勿恤，南征吉。",
        "white_words":"《升》卦：大通顺，见大人有利，不要犹疑。往南方会吉利。",
        "stock_suggestion":"阴阴阴 阳阳阴，巽为木。木植于地，由小到大，由低到高，年年生长。升，前景看好，走势分明。逐渐攀升。",
        "yaoci":"初六初爻上上：明月为钩，清风作线。举网烟波，锦鳞易见。\n　  　九三三爻上中：舟离古渡月离云，人出重关好问津。且向前行求去住，何须疑虑两三旬。\n  　　六五五爻上上：佳信至，见笑颜。飞腾一去，披云上天。\n",
        "picture":"地中生木，升。君子以顺德，积小以高大。",
        "white_picture":"木植于地中，是升卦的卦象。君子观此卦象，从而遵循德义，加强修养，从细小起步，逐步培育崇高的品德。"
    },

    "乾坎":{
        "name":"天水讼",
        "words":"有孚，窒惕，中吉，终凶。利见大人，不利涉大川。",
        "white_words":"《讼》卦:有俘虏，(加以)闭塞，警惕，中途是吉的，终于凶(被逃跑了)。看到大人有利。渡过大河不利。",
        "stock_suggestion":"阳阳阳 阴阳阴，天水隔绝，流向相背，事理乖舛，背道而驰之象，变动，多空分歧，震荡投机。放巨量。",
        "yaoci":"初六初爻上中：嘹呖征鸿独出群，高飞羽翼更斜云。分程正北堪图进，好个名声处处闻。\n　  　六三三爻上中：贵各相逢便可期，庭前枯木凤来仪。好将短事求长事，休听旁人说是非。\n  　　九五五爻上上：檐前鹊噪正翩翩，忧虑洗消喜自然。一个进了一个退，下梢总有好因缘。\n",
        "picture":"天与水违行，讼。君子以做事谋始。",
        "white_picture":"天水隔绝，流向相背，事理乖舛，这是讼卦的卦象。君子观此卦象，以杜绝争讼为意，从而在谋事之初必须慎之又慎。"
    },
    "兑坎":{
        "name":"泽水困",
        "words":"亨，贞，大人吉，无咎。有言不信。",
        "white_words":"《困》:顺利。占问重要人物的事吉利，没有困苦。你所说的话别 人不信。",
        "stock_suggestion":"阴阳阳 阴阳阴，大泽漏水，水草鱼虾，处于穷困之境，或泽中无水之表象，象征困顿。跌，市场低迷，毫无生机。弃差取优。",
        "yaoci":"九二二爻上中：足不安，心不安。两两事相得，忧来却又欢。\n　  　九四四爻上中：目下志难舒，有客来徐徐。金车虽历险，吝必有终欤。\n　  　上六六爻下下：缺月恐难圆，残花不再鲜，苦求名与利，到处遇迍邅。\n",
        "picture":"泽无水，困。君子以致命遂志。",
        "white_picture":"水渗泽底，泽中干涸，是困卦的卦象。君子观此卦象，以处境艰难自励，穷且益坚，舍身捐命，以行其夙志。"
    },
    "离坎":{
        "name":"火水未济",
        "words":"亨，小狐汔济，濡其尾，无攸利",
        "white_words":"《未济》卦：通顺，小狐快要渡过对岸，但它的尾巴给弄湿了，没 有利益。",
        "stock_suggestion":"阳阴阳 阴阳阴，水性下注，火势向上，水火不交，阴阳不得正位，未能完成和未能成功之意。不定，升跌失败形态，未到位可能反走。",
        "yaoci":"初六初爻中中：桑榆催晚景，缺月恐难圆。若遇刀锥客，方知有喜缘。\n  　　三六三爻下中：万里片帆轻，波平浪不惊。行行无阴滞，远虑更通津。\n　  　六五五爻上上：芰荷香里许恩材，桂魄圆时印绶来。从此威名山岳重，光辉玉节位三台。\n",
        "picture":"火在水上，未济。君子以慎辨物居方。",
        "white_picture":"火在水上，水不能克火，是未济卦的卦象。君子观此卦象，有感于水火错位不能相克，从而以谨慎的态度辨辩事物的性质，审视其方位。"
    },
    "震坎":{
        "name":"雷水解",
        "words":"利西南。无所往，其来复吉。有攸往，夙吉。",
        "white_words":"《解》卦：去西南有利。无所为而去(没好处),他的回来，吉。有所为而去，早去吉。",
        "stock_suggestion":"阴阴阳 阴阳阴，雷雨交加，荡涤宇内，草木舒展之象　遇困可解之意。升，走出困境低谷。买盘源源不断。",
        "yaoci":"九二二爻上上：万里波涛静，一天风雨闲。利名无阻隔，行路出重关。\n　  　九四四爻上上：湖海意悠悠，烟波下钓钩。若逢龙与兔，名利一齐周。\n　  　上六六爻上中：一箭青云路，营求指日成。许多闲口语，翻作笑歌声。\n",
        "picture":"雷雨作，解。君子以赦过宥罪。",
        "white_picture":"雷雨并作，化育万物，是解卦的卦象。君子观此卦象，从而赦免过失，宽宥罪人。"
    },
    "巽坎":{
        "name":"风水涣",
        "words":"亨，王假有庙。利涉大川，利贞。",
        "white_words":"《涣》卦：通顺。国王来到宗庙，有利于渡大河，利于占问。",
        "stock_suggestion":"阳阳阴 阴阳阴，上卦为巽，巽为风。风行水上，四方横流。主力趁机发力,推波助澜，大风吹物，人气涣散，人心不聚,谨防接机出货。",
        "yaoci":"初六初爻上上：云静日当中，光辉到处通。道途逢水源，千里快如风。\n　  　六三三爻中中：望处应重山，高深渐可攀。举头天上看，明月出人间。\n　  　九五五爻中中：不归一，劳心力。贵人旁，宜借力。\n",
        "picture":"风行水上，涣。先王以享于帝，立庙。",
        "white_picture":"风行水上，是涣卦的卦象。先王观此卦象，从而享祭天帝，建立宗庙，推行尊天孝祖的“德教”"
    },
    "坎坎":{
        "name":"坎为水",
        "words":"习坎，有孚，维心亨，行有尚。",
        "white_words":"《坎》卦：重坑(坑中有坑),有俘虏，要维系他的心，通顺。出行 有赏赐。",
        "stock_suggestion":"阴阳阴阴阳阴，两坎相重，坎为险为水，可见其卦象为重重险阻，又像水长流不息。大跌，暴跌跳水，连连逃命,进退失据。",
        "yaoci":"九二二爻下中：梦里说江水，波深下钓难。利名终有望，目下未开颜。\n　  　陆肆四爻上上：莫怪事迟留，休言不到头。长竿终入手，一钓上金钩。\n  　　上九六爻下下：疑疑疑，一番笑后一番悲。落红满地无人扫，独对西风扶黛眉。\n",
        "picture":"水洊至，习坎。君子以常德行，习教事。",
        "white_picture":"坎为永，水长流不滞，是坎卦的卦象。君子观此卦象，从而尊尚德行，取法于细水长流之象，学习教化人民的方法。"
    },
    "艮坎":{
        "name":"山水蒙",
        "words":"亨。匪我求童蒙，童蒙求我。初筮告，再三渎，渎则不告。利贞。",
        "white_words":"《蒙》卦:通顺。不是我求蒙昧的童子，蒙昧的童子求我。初次占嫉告诉(吉凶)，再三占亵渎(神灵)，(神灵)不再告诉。利于占问。",
        "stock_suggestion":"阳阴阴 阴阳阴，山下有险，草木丛生，迷模摸索之意，不定，市场朦胧，认真思考，研判走势,只能等待有利行情 ",
        "yaoci":"初六初爻下中：门外起干戈，亲朋两不和。朱衣临日月，始觉笑呵呵。\n　  　六三三爻下下：娶女无攸利，花间又及秋。严霜将荐至，退步不存留。\n　  　六五五爻下下：乘病马上，危坡防失，跌见蹉跎。\n",
        "picture":"山下出泉，蒙。君子以果行育德。",
        "white_picture":"山下有泉，泉水喷涌而出，这是蒙卦的卦象。君子观此卦象，取法于一往无前的山泉，从而以果敢坚毅的行动来培养自身的品德。"
    },
    "坤坎":{
        "name":"地水师",
        "words":"贞，丈人吉，无咎。",
        "white_words":"《师》卦:占间(任命)总指挥是吉的，无害。",
        "stock_suggestion":"阴阴阴 阴阳阴，地中蕴藏聚集了大量的水，取之不尽，用之不竭，象征兵源充足。大战在即,作风凶悍,领头羊。",
        "yaoci":"九二二爻上上：秋月云开后，薰风雨过时。若逢楚国旧知己，等闲一荐不须疑。\n　  　陆肆四爻下中：青氈终复旧，枝上果生风。莫谓一时喜，还疑此象凶。\n　  　上六六爻上上：谋已定，事何忧。金鳞已上钩，功名一网收。\n",
        "picture":"地中有水，师。君子以容民畜众。",
        "white_picture":"“地中有水”，这是师卦的卦象。君子观此卦象，取法于容纳江河的大地，收容和畜养大众。"
    },

    "乾艮":{
        "name":"天山遁",
        "words":"亨。小利贞",
        "white_words":"《遁》卦：通顺。占问有小利。",
        "stock_suggestion":"阳阳阳阳阴阴，天下有山，天高山远，正是贤人君子摆脱桎梏，避免灾害，挂冠悬笏，退隐山林的理想境界。所以卦名曰遁。跌，空头市场，连续暴跌，急流勇退。出货。",
        "yaoci":"六二二爻中中：兀兀尘埃又待时，幽窗静处有谁知。若逢青紫人相引，财利功名自可期。\n　  　九四四爻上中：一得一虑，宜后欲先。路通大道，心事安然。\n　  　上九六爻上上：一番桃李一番新，谁识阳和气象明。林下水边多活计，见山了了称人情。\n",
        "picture":"天下有山，遁。君子以远小人，不恶而严。",
        "white_picture":"天下有山，天高山远，是遁卦的卦象。君子观此卦象，从而不用以恶报恶的方法对付小人，而是采取严厉的态度，挂冠悬笏，自甘退隐，远离小人。"
    },
    "兑艮":{
        "name":"泽山咸",
        "words":"亨，利贞。取女吉。",
        "white_words":"《咸》卦：通顺。占问有利。娶新妇吉。",
        "stock_suggestion":"阴阳阳阳阴阴，山中有泽，山气水息，互相感应，山泽通气之象　往来无阻之意。升，人气互咸，亨通有利。",
        "yaoci":"初六六爻中中：意在关中信未来，故人千里自徘徊。天边雁足传书至，一点梅花喜色开。\n　  　九三三爻下下：休道事无论讹，其中进退多。桂轮圆又缺，光彩更揩磨。\n　　  九五五爻下中：事了物未了，人圆物未圆。要知端的信，月影上阑干。\n",
        "picture":"山上有泽，咸。君子以虚受人。",
        "white_picture":"山中有泽，山气水息，互相感应，是咸卦的卦象。君子观此卦象，取法于深邃的山谷，深广的大泽，从而虚怀若谷，以谦虚的态度，接受他人的教益。"
    },
    "离艮":{
        "name":"火山旅",
        "words":"小亨，旅贞吉。",
        "white_words":"《旅》:小通顺，占问旅程吉。",
        "stock_suggestion":"阳阴阳阳阴阴，艮（山）下离（火）上，为火势匆匆蔓延之表象，象征行旅之人匆匆赶路无常。进退不果，上下跳空，东奔西跑。逢高减仓，不可恋战。",
        "yaoci":"六二二爻上上：悲脸笑颜开，秋月挂高台，人从千里来。\n　  　九四四爻中中：花落正逢春，行人在半程。事成还不就，索绊两三旬。\n　  　上九六爻中中：憔悴无人问，林间听杜鹃。一声山月笛，千里暗销魂。\n",
        "picture":"山上有火，旅。君子以明慎用刑，而不留狱。",
        "white_picture":"山上有火，洞照幽隐，这是旅卦的卦象。君子观此卦象，从而明察刑狱，慎重判决，既不敢滥施刑罚，也不敢延宕滞留。"
    },
    "震艮":{
        "name":"雷山小过",
        "words":"亨，利贞。可小事，不可大事。飞鸟遗之音。不宜上，宜下，大吉。",
        "white_words":"《小过》卦：通顺，有利占问，可以做碎琐事，不可以做重大的事。\n雀鸟飞过只留下叫声回旋，不宜向上飞，宜下飞，大吉。",
        "stock_suggestion":"阴阴阳 阳阴阴，人过山顶，天上鸣雷，宜行小事，不宜做大事，宜回调。整理，过高则凶，不可大玩。 ",
        "yaoci":"初六初爻下下：物不牢，人断桥。重整理，慢心高。\n　  　九三三爻下下：深户要牢扃，须防暗里人。莫言无外事，纵好定遭迍。\n　　  六五五爻上上：空空空，空里得成功。蟠桃千年熟，不怕五更风。\n",
        "picture":"山上有雷，小过。君子以行过乎恭，丧过乎衰，用过乎俭。",
        "white_picture":"山上有雷，是小过的卦象。君子观此卦象，惧畏天雷，不敢有过失。因而行事不敢过于恭谦，居丧不敢过度哀伤，用度不敢过于节俭，唯适中而已。"
    },
    "巽艮":{
        "name":"风山渐",
        "words":"渐：女归吉，利贞。",
        "white_words":"《渐》卦：嫁女，结果是吉利，有利于占问。",
        "stock_suggestion":"阳阳阴 阳阴阴，木植于山上，不断生长，草木渐茂之象　积小成多之意，慢牛或阴跌，先压盘后渐拉升，逐步介入。",
        "yaoci":"六二二爻上上：阆苑一时春，庭前花柳新。鹊声传好信，草木自欣欣。\n  　　陆肆四爻上上：欲捉月中兔，须凭桃李梯。高山来接引，双喜照双眉。\n　  　上九六爻中中：意迷心不迷，事宽心不宽。一场双喜会，不久出重关。\n",
        "picture":"山上有木，以木在山，各得其所，如女子以归为所。君子得此象，观木 之渐长，非一时而成，便知事之由渐而善之理。",
        "white_picture":"巽为风、为顺、为长女，为以顺而归。媒妁之言，父母之命，及长而字 (嫁),渐渐而来，循序而进，名得其正，故曰“女归吉”"
    },
     "坎艮":{
        "name":"水山蹇",
        "words":"蹇：利西南，不利东北；利见大人，贞吉。",
        "white_words":"《蹇》卦：到西南去有利，到东北不利。见大人有利。占问吉。",
        "stock_suggestion":"阳阴阳 阳阴阴，山上有水，山石嶙峋，水流曲折。山高水险，喻人行路艰难，跌，市场险阻，艰难跋涉。难涨。",
        "yaoci":"初六初爻下中：岸阔水深舟易落，路遥山险步难行。行行自有通津日，目下香消月未明。\n　  　九三三爻下下：事虑淹留，人不彻头。往来闭塞，要见无由。\n　  　九五五爻中中：道路任招呼，风波一点无。时间心绪乱，全仗贵人扶。\n",
        "picture":"山上有水，蹇。君子以反身修德。",
        "white_picture":"卦体坎上艮下，水上山下，水欲流而山止之故曰：“蹇”。坎位北，艮  位东北，卦体内艮外坎，自东而北，逆天而行。"
    },
    "艮艮":{
        "name":"艮为山",
        "words":"艮其背，不获其身。行其庭，不见其人。无咎。",
        "white_words":"《艮》卦：注意他的背部，却没有保护全身，走到家中的庭园发现，没有人，没有害。",
        "stock_suggestion":"阳阴阴 阳阴阴，艮为山，山为退稳之处，又有静止稳重之象，喻人进而思退，明哲保身，所以卦名曰艮。止盘，阻力大，难进退。空方压制。",
        "yaoci":"六二二爻中中，易非易，难非难。忽然平地起波澜，歌笑须教三两番。\n  　　陆肆六爻中中：山山有路，有终有始。似月似花，守成而已。\n  　　上九六爻上上：宝镜无尘染，金貂已剪裁。也逢天意合，终不染尘埃。\n",
        "picture":"兼山，艮。君子以思不出其位。",
        "white_picture":"两艮卦相重，艮为山，可见艮卦的卦象是高山重立，渊深稳重。君子观此卦象，以此为戒，谋不踰位，明哲保身。"
    },
    "坤艮":{
        "name":"地山谦",
        "words":"亨，君子有终。",
        "white_words":"《谦》卦:通顺。贵族(谦让)有好结果。",
        "stock_suggestion":"阴阴阴 阳阴阴，艮（山）下坤（地）上，为高山隐藏于地中之表象，象征高才美德隐藏于心中而不外露，所以称作谦。升，谨慎上扬。",
        "yaoci":"初六初爻下中：恐怕正忧煎，忧非满目前。若逢明鉴照，挠括信空传。\n　  　九三三爻上中：劳心慢劳心，劳心终有成。清风来借力，欢笑见前程。\n　  　六五五爻下中：莺语燕呢喃，花开满院间。倚阑春梦觉，无语敛愁颜。\n",
        "picture":"地中有山，谦。君子以裒多益寡，称物平施。",
        "white_picture":"地中有山，内高外卑，居高不傲，这是谦卦的卦象。君子观此卦象，以谦让为怀，裁取多余昀，增益缺乏的，衡量财物的多寡而公平施予。"
    },

    "乾坤":{
        "name":"天地否",
        "words":"否之匪人。不利君子贞。大往小来。",
        "white_words":"《否》卦:干坏事的是坏人。贵族占问不利。大的去了小的来。",
        "stock_suggestion":"阳阳阳阴阴阴，阳气上升，阴气下沉，互不相通，天地闭塞，万物咽阻，跌，再创三阴新低。且站且走,逢高减仓。",
        "yaoci":"初六初爻上中：相引更相牵，殷勤喜自然。施为无不利，愁事变团圆。\n　  　六三三爻下下：无踪又无迹，远近终难觅。平地起风云，似笑还成泣。\n　  　九五五爻下下：身不安，心不安。动静两三番，终期事必欢。\n",
        "picture":"天地不交，否。君子以俭德辟难，不可荣以禄。",
        "white_picture":"天地隔阂不能交感，万物咽窒不能畅釜，这是否卦的卦象。君子观此卦象，从而在国家政治否塞之时，应思隐居不仕，以崇尚俭约来躲避灾难，不要以利禄为荣。"
    },
    "兑坤":{
        "name":"泽地萃",
        "words":"亨，王假有庙。利见大人，亨，利贞。用大牲吉。利有攸往。",
        "white_words":"《萃》卦：祭祀，王到了宗庙。见大人有利，通顺，占问有利。用 牛祭吉。有所往有利。",
        "stock_suggestion":"阴阳阳阴阴阴，有泽淹大地，洪水横流之象。用比喻政事丛杂，危机四伏。泽在地上，水聚于泥土中，滋养草木，生长茂盛。升，人气汇集，多头入市。",
        "yaoci":"六二二爻上中：笑中生不足，内外见愁哭。云散月光辉，转祸当成福。\n　  　九四四爻中中：言语参商，波涛鼎沸。事久无伤，时间不利。\n　  　上六六爻中中：无非应有忌，未为先恐踬。路险风波事更非，要得称心须借势。\n",
        "picture":"泽上于地，萃。君子以除戎器，戒不虞。",
        "white_picture":"泽水淹地，是萃卦的卦象。君子观此卦象，以洪水横流，祸乱丛聚为戒，从而修治兵器，戒备意外的变乱。"
    },
    "离坤":{
        "name":"火地晋",
        "words":"康侯用锡马蕃庶，昼日三接。",
        "white_words":"《晋》卦：康侯用(周成王)赐给他的良马来繁殖， 一天三次交配。",
        "stock_suggestion":"阳阴阳阴阴阴，太阳照大地，万物欣欣向荣；震荡，反复三次，上下箱形震荡,利好初来,跃跃欲试。初升。",
        "yaoci":"初六初爻上中：须著力，莫游遨。长竿钓向蟾蜍窟，直欲云中得巨鳌。\n  　　六三三爻上上：两两意和同，轻帆遇顺风。道逢人得意，歌唱急流中。\n   　六五五爻中中：万里涉江山，风波尽日闲。已吞钩上饵，何必遇波澜。\n",
        "picture":"明出地上，晋。君子以自昭明德。",
        "white_picture":"太阳照大地，万物沐光辉”，是晋卦的卦象。君子观此卦象，从而光大自身的光明之德。"
    },
    "震坤":{
        "name":"雷地豫",
        "words":"利建侯行师。",
        "white_words":"《豫》卦:有利于分封诸侯和行军。",
        "stock_suggestion":"阴阴阳阴阴阴，五阴爻和应一阳爻，象征着弱者服从强者，强者能够贯彻实行自己的意志。春雷轰鸣，大地萌动，催发万物，借力打力,尽情拉升。",
        "yaoci":"六二二爻中中：凿石得玉，淘沙得珠。眼前目下，何用踌躇。\n　  　九四四爻上上：名成利遂勿忧煎，菊里秋风道坦然。得意便垂三尺钓，长竿获得锦鳞鲜。\n　  　上六六爻下下：独钓寒潭涧，中途兴已阑。水寒鱼不饵，小艇月明还。\n",
        "picture":"雷出地奋，豫。先王以作乐崇德，殷荐之上帝，以配祖考。",
        "white_picture":"春雷轰鸣，大地震动，催发万物，这是豫卦的卦象。先王观此卦象，取法于声满大地的雷鸣，制作音乐，歌功颂德，光荣归于上帝，光荣归于祖考。"
    },
    "巽坤":{
        "name":"风地观",
        "words":"盥而不荐，有孚顒若。",
        "white_words":"《观》:祭祀时灌酒降神而不献人牲，因为用作祭祀的俘虏的头部 肿了，不能用作祭品。",
        "stock_suggestion":"阳阳阴阴阴阴，风行大地吹拂万物，止跌，见低反弹或观望,风险过高。",
        "yaoci":"初六六爻上上：野鬼暗张弧，射中主人惊。红日沉江海，空中事不成。\n　  　陆肆四爻上上：双燕衔书舞，指日一齐来。寂寞淹留客，从兹下钓台。\n　  　九五五爻下中：云叆叆，月朦朦。一雁入云中，残花谢晓风。\n",
        "picture":"风行地上，观。先王以省方，观民设教",
        "white_picture":"风行大地吹拂万物，这是观的卦象。先王观此卦象取法于周流八方的风，从而巡视邦国，观察民情，推行教化。"
    },
    "坎坤":{
        "name":"水地比",
        "words":"吉。原筮，元永贞，无咎。不宁方来，后夫凶。",
        "white_words":"《比》卦:再嫉大通顺。占问长期无害。不愿臣服的侯国来，迟到的人凶。",
        "stock_suggestion":"阴阳阴阴阴阴，水附大地，地纳江海，这是互柑依赖亲密之象，升，众星拱比，枯树开花，相互比仿,股随大盘。",
        "yaoci":"六二二爻中中：一人去，一人来。清风明月两相猜，获得金鳞下钓台。\n  　　陆肆四爻下中：无端风雨吹春去，落尽枝头桃李花。枕畔有人歌且笑，教君心事乱如麻。\n   　上六六爻下下：喜未稳，愁已遭。大雨狂风临古木，人人尽道不坚牢。\n",
        "picture":"地上有水，比。先王以建万国，亲诸侯。",
        "white_picture":"地上有水，这是比卦的卦象。先王观此卦象，取法于水附大地，地纳江河之象，封建万国，亲近诸侯。"
    },
    "艮坤":{
        "name":"山地剥",
        "words":"不利有攸往。",
        "white_words":"《剥》卦：对有所往不利。",
        "stock_suggestion":"阳阴阴阴阴阴，山附于地喻山石崩而落于地面上，五阴迫一阳，正义被损。跌，层层剥落，连创新低，走向低迷,出货。",
        "yaoci":"　初六初爻下下：上接不稳，下接不和。相缠相扰，平地风波。\n　　  六三三爻上上：玉石犹蒙昧，那堪小悔多。终无咎，笑呵呵。\n　  　六五五爻中中：圆又缺，缺又圆，低低密密要周旋，时来始见缘。\n",
        "picture":"山附于地，剥。上以厚下，安宅。",
        "white_picture":"山在地上，风雨剥蚀，这是剥卦的卦象。君子观此卦象，以山石剥落，岩角崩塌为戒，从而厚结民心，使人民安居乐业。"
    },
    "坤坤":{
        "name":"坤为地",
        "words":"元，亨，利牝马之贞。君子有攸往，先迷后得主。利西南得朋，东北丧朋。安贞，吉。",
        "white_words":"《坤》卦:大通顺。占问雌马有利。君子有所往，起先迷路，后来得到房主人( 的接待 )。有利于到西南方去赚钱，到东北去会失财。占问安居，吉。",
        "stock_suggestion":"阴阴阴阴阴阴，大地厚实，承载万物，柔顺舒展，窄幅收敛,主力手法隐蔽,走势柔和,股随龙头股而动。 ",
        "yaoci":"六二二爻上上：师征千里福绵绵，造化生成信自然。功名得就神明助，蛇鬼相逢自变迁。万顷波涛无点化，一天风月更幽闲。大明在在红轮照，名利何须自作难。\n　  　陆肆四爻下下：路不通，门闭塞。谨慎提防，月藏云黑。\n　  　上六六爻下中：月缺花残，镜破钗分。休来休往，事始安宁。\n",
        "picture":"地势坤，君子以厚德载物。。",
        "white_picture":"大地的形势平铺舒展，顺承天道。君子观此卦象，取法于地，以深厚的德行来承担重大的责任。"
    }
}
